// 向某位女生发送一则表白短信
// name: 女神的姓名
// onFulffiled: 成功后的回调
// onRejected: 失败后的回调
function sendMessage(name) {
  return new Promise((resolve, reject) => {
    // 模拟 发送表白短信
    console.log(
      `邓哥 -> ${name}：最近有谣言说我喜欢你，我要澄清一下，那不是谣言😘`
    );
    console.log(`等待${name}回复......`);
    // 模拟 女神回复需要一段时间
    setTimeout(() => {
      // 模拟 有10%的几率成功
      if (Math.random() <= 0.1) {
        // 成功，调用 onFuffiled，并传递女神的回复
        resolve(`${name} -> 邓哥：我是九，你是三，除了你还是你😘`);
      } else {
        // 失败，调用 onRejected，并传递女神的回复
        reject(`${name} -> 邓哥：你是个好人😜`);
      }
    }, 1000);
  });
}

// 邓哥的女神一共有4位，名字分别是：李建国、王富贵、周聚财、刘人勇
// 稳妥起见，邓哥决定使用串行的方式进行表白：先给第1位女神发送短信，然后等待女神的回应，如果成功了，就结束，如果失败了，则再给第2位女神发送短信，依次类推
const p = sendMessage("李建刚");

p.then(
  (reply) => {
    console.log("成功", reply);
  },
  (reply) => {
    console.log("失败", reply);
    sendMessage("王富贵").then(
      (reply) => {
        console.log("成功", reply);
      },
      (reply) => {
        console.log("失败", reply);
        sendMessage("周聚财").then(
          (reply) => {
            console.log("成功", reply);
          },
          (reply) => {
            console.log("失败", reply);
            sendMessage("刘人勇").then(
              (reply) => {
                console.log("成功", reply);
              },
              (reply) => {
                console.log("失败", reply);
                console.log("邓哥命犯天煞孤星，注定孤独终老！！");
              }
            );
          }
        );
      }
    );
  }
);
